calphil/ardupilot/libraries/AP_HAL_ESP32/boards/esp32philo copy.h
/*
 * This file is free software: you can redistribute it and/or modify it
 * under the terms of the GNU General Public License as published by the
 * Free Software Foundation, either version 3 of the License, or
 * (at your option) any later version.
 *
 * This file is distributed in the hope that it will be useful, but
 * WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.
 * See the GNU General Public License for more details.
 *
 * You should have received a copy of the GNU General Public License along
 * with this program.  If not, see <http://www.gnu.org/licenses/>.
 */



/////////////////////////////////////////////////////
// StampflyRHYS with pins changed
//Pins
/*
 * I2c0 13,15
 * I2c1 23,19  >>> SPI instead as below:
 * SPI SDI 23
 *     CLK 19
 *     SDA(ADO/SD0) 18
 *     NCS 26
 * 
 * RMT 4
 * RCOUT 25,27, 33,32           // nope: , 22, 21
 *  UART 0:   3 , 1   (Con 115200)
 *  UART 1:   34 in only has to Rx , 18  
 *  UART 2:   16 , 17  (GPS     #define AP_SERIALMANAGER_GPS_BAUD               230400)
*/







#pragma once

// make sensor selection clearer
#define PROBE_IMU_I2C(driver, bus, addr, args ...) ADD_BACKEND(AP_InertialSensor_ ## driver::probe(*this,GET_I2C_DEVICE(bus, addr),##args))
#define PROBE_IMU_SPI(driver, devname, args ...) ADD_BACKEND(AP_InertialSensor_ ## driver::probe(*this,hal.spi->get_device(devname),##args))
#define PROBE_IMU_SPI2(driver, devname1, devname2, args ...) ADD_BACKEND(AP_InertialSensor_ ## driver::probe(*this,hal.spi->get_device(devname1),hal.spi->get_device(devname2),##args))

#define PROBE_BARO_I2C(driver, bus, addr, args ...) ADD_BACKEND(AP_Baro_ ## driver::probe(*this,std::move(GET_I2C_DEVICE(bus, addr)),##args))
#define PROBE_BARO_SPI(driver, devname, args ...) ADD_BACKEND(AP_Baro_ ## driver::probe(*this,std::move(hal.spi->get_device(devname)),##args))

#define PROBE_MAG_I2C(driver, bus, addr, args ...) ADD_BACKEND(DRIVER_ ##driver, AP_Compass_ ## driver::probe(GET_I2C_DEVICE(bus, addr),##args))
#define PROBE_MAG_SPI(driver, devname, args ...) ADD_BACKEND(DRIVER_ ##driver, AP_Compass_ ## driver::probe(hal.spi->get_device(devname),##args))
#define PROBE_MAG_IMU(driver, imudev, imu_instance, args ...) ADD_BACKEND(DRIVER_ ##driver, AP_Compass_ ## driver::probe_ ## imudev(imu_instance,##args))
#define PROBE_MAG_IMU_I2C(driver, imudev, bus, addr, args ...) ADD_BACKEND(DRIVER_ ##driver, AP_Compass_ ## driver::probe_ ## imudev(GET_I2C_DEVICE(bus,addr),##args))
//------------------------------------


//#define CONFIG_HAL_BOARD_SUBTYPE HAL_BOARD_SUBTYPE_ESP32_S3M5STAMPFLY
// make sensor selection clearer
//#define HAL_ESP32_BOARD_NAME "esp32s3m5stampfly"
#define HAL_ESP32_BOARD_NAME "esp32philo" //phil TODO chg to unique name
#define CONFIG_HAL_BOARD_SUBTYPE HAL_BOARD_SUBTYPE_ESP32_PHILO

//- these are missing from esp-idf......will not be needed later
#define RTC_WDT_STG_SEL_OFF             0
#define RTC_WDT_STG_SEL_INT             1
#define RTC_WDT_STG_SEL_RESET_CPU       2
#define RTC_WDT_STG_SEL_RESET_SYSTEM    3
#define RTC_WDT_STG_SEL_RESET_RTC       4


//#define HAL_ESP32_RMT_RX_PIN_NUMBER GPIO_NUM_14
#define HAL_ESP32_RMT_RX_PIN_NUMBER 4

//#define HAL_INS_PROBE_LIST PROBE_IMU_SPI(BMI270, "bmi270", ROTATION_ROLL_180_YAW_90)
//// SPI BUS setup, including gpio, dma, etc
//#define HAL_ESP32_SPI_BUSES \
    //{.host=SPI2_HOST, .dma_ch=SPI_DMA_CH_AUTO, .mosi=GPIO_NUM_14, .miso=GPIO_NUM_43, .sclk=GPIO_NUM_44}
//// SPI2 was used in original firmware

//// SPI per-device setup, including speeds, etc.
//#define HAL_ESP32_SPI_DEVICES \
    //{.name= "bmi270", .bus=0, .device=0, .cs=GPIO_NUM_46, .mode=3, .lspeed=10*MHZ, .hspeed=10*MHZ}, \
    //{.name="pixartflow", .bus=0, .device=1, .cs=GPIO_NUM_12, .mode=3, .lspeed=2*MHZ, .hspeed=2*MHZ},
#define HAL_INS_DEFAULT HAL_INS_MPU9250_SPI
#define HAL_INS_MPU9250_NAME "mpu9250"
#define HAL_INS_PROBE_LIST PROBE_IMU_SPI( Invensense, HAL_INS_MPU9250_NAME, ROTATION_NONE)
#define HAL_ESP32_SPI_BUSES   {.host=VSPI_HOST, .dma_ch=1, .mosi=GPIO_NUM_23, .miso=GPIO_NUM_18, .sclk=GPIO_NUM_19}
// SPI per-device setup, including speeds, etc.
#define HAL_ESP32_SPI_DEVICES  {.name="mpu9250", .bus=0, .device=0, .cs=GPIO_NUM_26,  .mode = 0, .lspeed=2*MHZ, .hspeed=8*MHZ}
#define HAL_SPI_DEVICE_LIST HAL_ESP32_SPI_DEVICES   // , deliminated


#define HAL_BARO_DEFAULT        HAL_BARO_BMP280_I2C
#define HAL_BARO_BMP085_NAME        "bmp280"
#define HAL_BARO_PROBE_LIST         PROBE_BARO_I2C(BMP280, 0, 0x76)

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@
//STAMPFLY
//#define AP_COMPASS_ENABLED 1
//#define AP_COMPASS_BMM150_ENABLED 1
//// #define AP_COMPASS_ENABLE_DEFAULT 0
//#define ALLOW_ARM_NO_COMPASS 1
//#define HAL_MAG_BMM150_NAME "BMM150"
//#define HAL_MAG_PROBE_LIST PROBE_MAG_I2C(BMM150, 0, 0x10, 0, ROTATION_YAW_90)

//PHILS
//#define AP_COMPASS_AK8963_ENABLED TRUE
//phil on SPI instance nos = 0 (bus=0 ???)
//#define HAL_MAG_PROBEphil1  ADD_BACKEND(DRIVER_AK8963, AP_Compass_AK8963::probe_mpu9250(0, ROTATION_NONE))

//#define AP_COMPASS_HMC5843_ENABLED 1
//#define HAL_MAG_PROBEphil2 ADD_BACKEND(DRIVER_HMC5843, AP_Compass_HMC5843::probe(GET_I2C_DEVICE(0, 0x1e), false, ROTATION_NONE))

//#define HAL_MAG_PROBE_LIST HAL_MAG_PROBEphil1;HAL_MAG_PROBEphil2
//#define HAL_MAG_PROBE_LIST HAL_MAG_PROBEphil1

//#define HAL_PROBE_EXTERNAL_I2C_COMPASSES 1
//#define AP_COMPASS_HMC5883_ENABLED 1

// we run the AK8963 only on the 2nd MPU9250, which leaves the
        // first MPU9250 to run without disturbance at high rate
//      ADD_BACKEND(DRIVER_AK8963, AP_Compass_AK8963::probe_mpu9250(1, ROTATION_YAW_270));

//#define HAL_MAG_PROBE_LIST ADD_BACKEND(DRIVER_, AP_Compass_AK09916::probe_ICM20948_I2C(0, ROTATION_NONE));

//@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@

#define AP_COMPASS_ENABLED 1
#define AP_COMPASS_HMC5843_ENABLED 1
// #define AP_COMPASS_ENABLE_DEFAULT 0
#define ALLOW_ARM_NO_COMPASS 1
//#define HAL_MAG_BMM150_NAME "BMM150" //phil Nope Never used
//#define HAL_MAG_PROBE_LIST PROBE_MAG_I2C(BMM150, 0, 0x10, 0, ROTATION_YAW_90)
#define HAL_MAG_PROBE_LIST PROBE_MAG_I2C(HMC5843, 0, 0x10, 0, ROTATION_NONE)



#define AP_AIRSPEED_ENABLED 0
#define AP_AIRSPEED_ANALOG_ENABLED 0
#define AP_AIRSPEED_BACKEND_DEFAULT_ENABLED 0

// no ADC
#define HAL_DISABLE_ADC_DRIVER 1
#define HAL_USE_ADC 0

#define AP_BATTERY_INA3221_ENABLED 1
#define HAL_BATTMON_INA3221_SHUNT_OHMS 0.01
#define HAL_BATTMON_INA3221_SHUNT_CONV_TIME_SEL HAL_BATTMON_INA3221_CONV_TIME_4156US
#define HAL_BATTMON_INA3221_BUS_CONV_TIME_SEL HAL_BATTMON_INA3221_CONV_TIME_4156US
#define HAL_BATTMON_INA3221_AVG_MODE_SEL HAL_BATTMON_INA3221_AVG_MODE_16

// 2 use udp, 1 use tcp...  for udp,client needs to connect as UDPCL in missionplanner etc to 192.168.4.1 port 14550
#define HAL_ESP32_WIFI 2

// see boards.py
#ifndef ENABLE_HEAP
#define ENABLE_HEAP 1
#endif

#define WIFI_SSID "a123"
#define WIFI_PWD "a123"

//RCOUT which pins are used?

// r-up, l-down, l-up, r-down (quad X order)
//#define HAL_ESP32_RCOUT {GPIO_NUM_25, GPIO_NUM_27, GPIO_NUM_33, GPIO_NUM_32}
#define HAL_ESP32_RCOUT {GPIO_NUM_25, GPIO_NUM_27, GPIO_NUM_33, GPIO_NUM_32}

//I2C bus list
//#define HAL_ESP32_I2C_BUSES \
    //{.port=I2C_NUM_0, .sda=GPIO_NUM_3, .scl=GPIO_NUM_4, .speed=400*KHZ, .internal=true}
    // Use RED Grove connector as UART instead 
    // {.port=I2C_NUM_1, .sda=GPIO_NUM_13, .scl=GPIO_NUM_15, .speed=400*KHZ, .internal=false}



//HARDWARE UARTS. UART 0 apparently goes over USB? so we assign it to pins we
// don't have mapped to anything. UART 1 is the black grove connector
// UART0 = SERIAL0 = USB
// UART1 = SERIAL3 (Grove Blk: [1.: Rx, 2: Tx, 3: VCC, 4: GND])
// UART2 = SERIAL2 (Grove Red: [1.: Rx, 2: Tx, 3: VCC, 4: GND]) - signal lines have 4.7kΩ pullup to 3V3
#define HAL_ESP32_UART_DEVICES \
  {.port=UART_NUM_0, .rx=GPIO_NUM_18, .tx=GPIO_NUM_17 }, \
  {.port=UART_NUM_1, .rx=GPIO_NUM_1,  .tx=GPIO_NUM_2 }, \
  {.port=UART_NUM_2, .rx=GPIO_NUM_15, .tx=GPIO_NUM_13 }

#define HAL_LOGGING_FILESYSTEM_ENABLED 0
#define HAL_LOGGING_DATAFLASH_ENABLED 0
#define HAL_LOGGING_MAVLINK_ENABLED 1

#define HAL_BOARD_LOG_DIRECTORY "/SDCARD/APM/LOGS"
#define HAL_BOARD_STORAGE_DIRECTORY "/SDCARD/APM/STORAGE"
#define HAL_BOARD_LOG_DIRECTORY "/SDCARD/APM/LOGS"
#define HAL_BOARD_TERRAIN_DIRECTORY "/SDCARD/APM/TERRAIN"

#define HAL_LOGGING_BACKENDS_DEFAULT 2

#define AP_RCPROTOCOL_ENABLED 0

#define AP_FILESYSTEM_ESP32_ENABLED 0
#define AP_SCRIPTING_ENABLED 0

#define AP_OPTICALFLOW_ENABLED 0
